import React, { useState, useEffect } from 'react';
import {useNavigate, useLocation, Route, Routes, Outlet} from 'react-router-dom';
import Tab from 'react-bootstrap/Tab';
import Tabs from 'react-bootstrap/Tabs';
import viz2 from './public/viz2.png';
import viz3 from './public/viz3.png';
import viz4 from './public/viz4.png';
import bleed from "./public/bleed.png";


function Vimogi() {
    const navigate = useNavigate();
    const location = useLocation();

    // Оновлюємо активну вкладку при зміні URL
    useEffect(() => {
        const path = location.pathname.replace('/Vimogi/', '');
        if (path) setActiveTab(path);

    }, [location.pathname]);

    // Функція для зміни вкладки + оновлення URL
    const handleSelect = (eventKey) => {
        setActiveTab(eventKey);
        navigate(`/Vimogi/${eventKey}`);
    };
    const [activeTab, setActiveTab] = useState("colorprinthelp");
    return (
        <>
            <Tabs
                activeKey={activeTab}
                onSelect={handleSelect}
                id="vimogiclas"
                className="vimogiclas nav-tabs"
                justify
            >
                <Tab className="nav-tabs" eventKey="colorprinthelp" title="Цифровий друк"></Tab>
                <Tab eventKey="ofsethelp" title="Офсетний друк">
                    <div className="component-2022-21">
                        <p><strong>Загальні вимоги до файлів</strong></p>
                            <li>- Макети приймаються у форматах TIFF, PDF, PSD</li>
                            <li>- Якість для макетів - не менше 300 dpi (Якщо неякісним зображенням примусово призначити 300 dpi, їх якість не покращиться. В цьому випадку краще замінити зображення якіснішими).        </li>
                            <li>- Елементи дизайну повинні розташовуватись не ближче 5 мм від краю готового виробу (дивіться рисунок нижче).        </li>
                            <li>- Мінімальний післяобрізний розмір – 40×40 мм.</li>
                        <li style={{marginBottom: '10px'}}>
                            - Елементи дизайну повинні розташовуватись не ближче 5 мм від краю
                            готового виробу.
                        </li>

                        <div className="bleed"
                             style={{display: 'flex', justifyContent: 'center', margin: "0.5vw", height: '18vh'}}>
                            <img className="bleed" alt="" src={bleed} style={{marginRight: '1vw'}}/>
                        </div>
                        <p className="print" style={{textAlign: 'center', marginTop: '1vh'}}>
                            Виліти — 2 мм якщо аркушева продукція (3 мм якщо багатосторінкова).
                        </p>
                        <li className="print" >
                            - Усі шари в растрових макетах повинні бути злиті в один.
                        </li>
                            <li className="print">- У PDF файлах не повинно бути OPI зв'язків.</li>
                            <li className="print">- Макет не повинен містити жодних ICC-профілів.</li>
                            <li className="print">
                               - У макетах не повинно бути прозоростей «Transparency».
                            </li>
                            <li className="print">- Мінімальна товщина ліній 0,5 pt. (0,17 мм).</li>



                        <div className="tverd-text17">
                            <div className="viz"
                                 style={{display: 'flex', justifyContent: 'center', margin: "0.5vw", height: '17vh'}}>
                                <img className="viz2" alt="" src={viz2} style={{marginRight: '1vw', borderTopLeftRadius: '1vw', borderBottomRightRadius: '1vw'}}/>
                                <img className="viz3" alt="" src={viz3} style={{marginRight: '3vw', borderTopRightRadius: '1vw', borderBottomLeftRadius: '1vw'}}/>
                                <img className="viz2" alt="" src={viz2} style={{marginRight: '1vw', borderTopLeftRadius: '1vw', borderBottomRightRadius: '1vw'}}/>
                                <img className="viz4" alt="" src={viz4} style={{borderTopRightRadius: '1vw', borderBottomLeftRadius: '1vw'}}/>
                            </div>
                            <p className="print" style={{textAlign: 'center'}}>
                                Макети для двостороннього друку </p>

                            <p><strong>Вимоги до кольорів</strong></p>
                            <li className="print">- Колірна модель — CMYK, Grayscale.</li>
                            <li className="print">
                                - Чорний колір плашок має бути — С-60 М-40 Y-40 K-100. Якщо робити за
                                формулою: C-0 М-0 Y-0 K-100, то після друку можна отримати виріб
                                сірого відтінку.
                            </li>
                            <li className="print">
                               -  «Плашкові кольори» необхідно готувати з найменшими складовими CMYK
                                для забезпечення більш точної передачі кольору.
                            </li>
                            <li className="print">
                                - Для білого тексту рекомендується робити треппінг на чорному
                                композитному тлі. Це зовнішнє обведення елементів в одну фарбу
                                завтовшки 0,25 pt. Його формула С-0 М-0 Y-0 K-100.
                            </li>
                            <li className="print">
                               - Для відтворення на друці відтінків синього кольору різниця між
                                каналами Cyan і Magenta повинна становити не менше 20% (Cyan має
                                бути більше), наприклад С-100 М-77 Y-0 K-0. Якщо колір потрібно
                                затемнити, додаємо BLACK.
                            </li>

                            <li className="print">
                               - Щоб отримати фіолетовий відтінок, Magenta має бути більшою або
                                рівною Cyan (як приклад С-80 М-93 Y-0 K-0). Формула С-100 М-100 Y-0
                                K-0 — це фіолетовий колір, навіть якщо у Вас на моніторі він
                                виглядає синім.
                            </li>
                            <li className="print">
                               - Сірий колір в одну фарбу повинен мати насиченість не більше С-0 M-0
                                Y-0 K-80.
                            </li>
                            <li className="print">
                                - Не потрібно задавати сіру плашку трьома фарбами без чорної, або
                                чотирма де відсоток кожної з фарб приблизно однаковий (наприклад
                                С-68 М-61 Y-61 K-50 або С-9 М-7 Y-8 K-0). У цьому випадку велика
                                ймовірність різнотону у тиражі, а також Ви можете не отримати очікуваний
                                відтінок. Наприклад, такий же колір С-68 М-61 Y-61 K-50 можна задати
                                формулою С-0 М-8 Y-7 K-87, а колір С-9 М-7 Y-8 K-0 можна задати формулою С-0 М-0 Y-0 K-11.
                            </li>

                            <li className="print">
                                - У 4-колірних роботах (CMYK) елементи в колірному просторі «RGB»,
                                «LAB», а також PANTONE повинні бути перетворені на CMYK.
                            </li>
                            <li className="print">
                                 - Мінімально відтворюваний відтінок за будь-яким каналом CMYK – 5%.
                            </li>
                        </div>

                        <div className="tverd-text18">
                            <p><strong>Вимоги до шифтів</strong></p>
                            <li className="print">
                                Шрифти у векторних файлах необхідно конвертувати у криві.
                            </li>
                            <li className="print">
                            Не допускається використання растрового тексту менше 8 пунктів,
                            інакше він може бути нечитабельним.
                        </li>
                        <li className="print">
                            У шрифтах не допускається чорний композитний колір (що складається
                            із 4 компонентів кольору).
                        </li>
                        <li className="print">
                            Чорний текст має відповідати формулі: С:0 М:0 Y:0 K:100.
                        </li>
                        <li className="print">
                            Елементи чорного кольору (С:0 М:0 Y:0 K:100), розташовані на
                            однорідному тлі, а також текст повинні мати атрибут «overprint»
                            (накладання).
                        </li>
                    </div>


                    </div>

                </Tab>
                <Tab eventKey="photoprinthelp" title="Друк фотографій" />
                <Tab eventKey="wideindustrialhelp" title="Широкоформатний промисловий друк">
                <div className="requirements-container" >
                    <li> При виготовлення продукції допускаються технологічні відхилення, недоліки, дефекти — які не проглядаються з відстані
                    - 5 метров при якості 720 dpi
                    / 3 метра при якості 1080 dpi
                    / 1 метр при якості 1440 dpi</li>
                    <p></p>
                    <p><strong>Загальні вимоги до файлів</strong></p>
                    <li>Макети приймаються у форматах TIFF, PDF.</li>
                    <li>Якість для макетів до формату А3 - 200 dpi, більше ніж формат А3 - 150 dpi.</li>
                    <li>У форматі PDF шрифти мають бути переведені у криві.</li>
                    <li>Макети мають бути в колірному просторі CMYK без будь-яких колірних профілів.</li>
                    <li>Макети мають бути підготовлені у масштабі 1:1 (без вильотів).</li>
                    <li>Макети обрізаються в край, тому краще робити безпечну зону від значущих елементів до краю макета мінімум 5 мм.</li>
                    <li>Під установку люверсів безпечна зона має бути щонайменше 25 мм від краю макета.</li>
                    <li>У макетах мають бути злиті шари та текст переведений у криві.</li>
                    <li>Чорний колір (плашки та великий текст) краще робити композитним CMYK (35-35-35-100).</li>
                    <li>Градієнти та суцільні заливки у сумі фарб мають бути не менше 30% за TIL (інакше може бути малопомітна плашка або градієнт).</li>
                    <li>Суцільний чорний колір не може бути представлений у CMY без чорного (інакше є вірогідність після друку отримати інший тріадний колір).</li>
                    <li>Дрібний текст (12pt) можна залишати в одну фарбу для більш чіткого друку.</li>
                    <li>Мітки під індивідуальне розташування люверсів повинні бути виконані контрастним кольором, кружки діаметром 10 мм з обведенням, центр кола повинен розташовуватися не ближче ніж 20 мм від краю макета.</li>
                    <p></p>
                    <p><strong>Друк макету цілісним шматком або розбиття його на частини</strong></p>
                    <li>У банера максимальна ширина рулона 3200 мм. Якщо у вас розмір макета по коротшій стороні більше 3180 мм, то замовлення складатиметься з частин "тайлів". Також майте на увазі, якщо замовлення з підворотами, тоді максимальний розмір за короткою стороною буде 3100 мм.</li>
                    <li>У самоклеючої плівки максимальна ширина рулону (крім плівки перфораційної One Way Vision) - 1600 мм. З цього випливає, що максимальний розмір за короткою стороною має бути 1580 мм. Інакше плівка буде складатися з декількох частин "тайлів". Для плівки "Плівка перфораційна One Way Vision" цей розмір - 1500 мм.</li>
                    <li>У паперу ширина рулону 1560 мм, тому менша сторона виробу не має перевищувати 1540 мм.</li>
                    <p></p>
                    <p><strong>Плоттерна порізка</strong></p>
                    <li>Макет для плотерної порізки не має перевищувати 1100х2000 мм.</li>
                    <li>Макет наклейки для плоттерного різання подається у форматі .pdf. Він повинен містити два шари: на нижньому шарі розташовується макет самої наклейки з вильотами, а на верхньому - контур порізки.</li>
                    <li>Макет самої наклейки може бути представлений як вектором, так і растром. Він має бути зроблений потрібної форми та розміру (1:1). І в макет мають бути закладені вильоти по 2 мм із кожної сторони, виконані продовженням фону.</li>
                    <li>Якщо фон наклейки білий, вильоти можна не додавати. Також для всіх важливих елементів макету – текст, зображення (але не фонове), штрих-код тощо – повинна бути дотримана безпечна зона в 2 мм «всередину» наклейки від контуру різання.</li>
                    <li>Контур різу повинен бути векторним, мати замкнутий контур, бути потрібної форми та розміру (1:1). Він має бути заданий окремим кольором (Spot color) "cut" із застосуванням атрибуту Overprint.</li>
                    <li>Колір контуру може бути будь-яким. Але бажано вибирати якийсь контрастний колір, щоб його добре було видно на тлі наклейки. Зазвичай добре підходить червоний колір (C0 M100 Y100 K0) або рожевий (C0 M100 Y0 K0).</li>
                </div>
            </Tab>
                <Tab eventKey="plotercuthelp" title="Плотерна порізка" />
                <Tab eventKey="layouthelp" title="Препрес / Постпрес"> </Tab>
                <Tab eventKey="Sublimationhelp" title="Сублімація"/>
            </Tabs>
            <Outlet/>
        </>

    );
}

export default Vimogi;
